define y = Character("衙役")
define p1 = Character("贾斯文", color="#a52a2a")
define z = Character("张清")

label scene_4:
    scene bg county_night
    with fade
    play music audio_wind fadein 1.0 loop
    "知县张清据说为人刚正不阿。"
    "如果我能在审判前主动揭发洪彦龙的罪行，或许兰家兄妹就能逃脱这个恶魔的魔爪。"
    "我整理了一下斗篷，从阴影中走出。"

    y "站住！什么人？"
    p1 "差爷恕罪！小人是洪彦龙洪国舅府上的师爷贾斯文，有十万火急的密信，必须亲手呈交知县大人"
    y "洪彦龙的师爷？"
    show y suspicious at left
    "明显能看出，衙役的态度明显更谨慎了"
    y "这么晚了，有何要事？"

    menu:
        "直接掏出银子":
            p1 "请差爷行个方便，此事关乎大人清誉，耽搁不得啊！"
            "衙役皱了皱眉毛，虽然看起来还是不太信任我的样子，但最终还是点了点头"
            show y normal at left
            y "你等着，我去通报。"
        "尝试用洪彦龙的身份压他":
            p1 "此信是国舅亲笔所写要给知县大人，鄙人已经说了十万火急，若是因为你们耽搁了，且看知县大人如何处置你们！"
            "衙役显然是咬紧了后槽牙，憋了半天才吐出两个字："
            y "等着。"
            "衙役转身离开，但我还是听见他还是小声说道："
            y "狗仗人势的东西..."
    
    "不知道过了多久，衙役回来了"
    y "进去吧，知县大人在书房等你。"

    scene bg county_study
    with dissolve
    "我走进张清的书房，他正在书案后坐着，手里捧着一卷书。"
    show magistrate normal at left
    with dissolve

    z "你是洪彦龙的师爷？"
    "我扑通一声跪倒在案前。"
    p1 "是，小人贾斯文，参见知县大人！"
    p1 "关于洪家和兰家的案子...小人有要事相禀!"
    z "讲。"
    p1 "大人明鉴！洪彦龙强抢民女，伪造婚书，意图构陷兰中玉！"
    "张清的脸色变了变，眯起了眼睛。"
    z "洪彦龙？你不是他师爷吗？这是什么意思？"
    p1 "小人……小人虽是寒门，却也读过圣贤书，知道‘忠义’二字！"
    p1 "他做的这些事情伤天害理、丧尽天良！明日公堂之上，他就要用一份假婚书来混淆是非！"
    p1 "小人……小人不忍见无辜之人蒙冤，更不忍见大人被奸人蒙蔽，特来告发！"
    $ add_ooc(-20)


    "张清沉默了片刻，手指轻轻敲击着桌面。"
    "..."
    "..."
    "..."
    "..."
    "...不知道过了多久，张清终于开口了。"

    z "给我说说吧，你有何证据？"

    p1 "知县大人...此婚书非兰中玉所写，且看....."

return